In [110]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# train = pd.read_csv('/Volumes/Samsung USB/Data Science/Projects/Credit Risk project/Data/application_train.csv')
# train

In [3]:
train = pd.read_csv(r'D:\Data Science\Projects\Credit Risk project\Data\application_train.csv')
train

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
307506,456251,0,Cash loans,M,N,N,0,157500.0,254700.0,27558.0,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307507,456252,0,Cash loans,F,N,Y,0,72000.0,269550.0,12001.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307508,456253,0,Cash loans,F,N,Y,0,153000.0,677664.0,29979.0,...,0,0,0,0,1.0,0.0,0.0,1.0,0.0,1.0
307509,456254,1,Cash loans,F,N,Y,0,171000.0,370107.0,20205.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
307510,456255,0,Cash loans,F,N,N,0,157500.0,675000.0,49117.5,...,0,0,0,0,0.0,0.0,0.0,2.0,0.0,1.0

## Data Cleaning

### Null Features

In [4]:
def fraction_missing(column):
    total_rows = len(column)
    missing_count = column.isnull().sum()
    return missing_count/total_rows

missing_fraction = train.apply(fraction_missing)
missing_fraction

SK_ID_CURR                    0.000000
TARGET                        0.000000
NAME_CONTRACT_TYPE            0.000000
CODE_GENDER                   0.000000
FLAG_OWN_CAR                  0.000000
                                ...
AMT_REQ_CREDIT_BUREAU_DAY     0.135016
AMT_REQ_CREDIT_BUREAU_WEEK    0.135016
AMT_REQ_CREDIT_BUREAU_MON     0.135016
AMT_REQ_CREDIT_BUREAU_QRT     0.135016
AMT_REQ_CREDIT_BUREAU_YEAR    0.135016
Length: 122, dtype: float64

In [5]:
high_missing_features_train = missing_fraction[missing_fraction > 0.5]
high_missing_features_train = high_missing_features_train.sort_values(ascending=False)
high_missing_features_train

COMMONAREA_AVG              0.698723
COMMONAREA_MEDI             0.698723
COMMONAREA_MODE             0.698723
NONLIVINGAPARTMENTS_MEDI    0.694330
NONLIVINGAPARTMENTS_AVG     0.694330
NONLIVINGAPARTMENTS_MODE    0.694330
FONDKAPREMONT_MODE          0.683862
LIVINGAPARTMENTS_MEDI       0.683550
LIVINGAPARTMENTS_AVG        0.683550
LIVINGAPARTMENTS_MODE       0.683550
FLOORSMIN_MODE              0.678486
FLOORSMIN_MEDI              0.678486
FLOORSMIN_AVG               0.678486
YEARS_BUILD_MODE            0.664978
YEARS_BUILD_AVG             0.664978
YEARS_BUILD_MEDI            0.664978
OWN_CAR_AGE                 0.659908
LANDAREA_AVG                0.593767
LANDAREA_MEDI               0.593767
LANDAREA_MODE               0.593767
BASEMENTAREA_MEDI           0.585160
BASEMENTAREA_AVG            0.585160
BASEMENTAREA_MODE           0.585160
EXT_SOURCE_1                0.563811
NONLIVINGAREA_MODE          0.551792
NONLIVINGAREA_MEDI          0.551792
NONLIVINGAREA_AVG           0.551792
ELEVATORS_MODE              0.532960
ELEVATORS_MEDI              0.532960
ELEVATORS_AVG               0.532960
WALLSMATERIAL_MODE          0.508408
APARTMENTS_MEDI             0.507497
APARTMENTS_MODE             0.507497
APARTMENTS_AVG              0.507497
ENTRANCES_MODE              0.503488
ENTRANCES_AVG               0.503488
ENTRANCES_MEDI              0.503488
LIVINGAREA_MEDI             0.501933
LIVINGAREA_AVG              0.501933
LIVINGAREA_MODE             0.501933
HOUSETYPE_MODE              0.501761
dtype: float64

In [6]:
train = train.drop(columns=high_missing_features_train.index)
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Data columns (total 81 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   SK_ID_CURR                    307511 non-null  int64
 1   TARGET                        307511 non-null  int64
 2   NAME_CONTRACT_TYPE            307511 non-null  object
 3   CODE_GENDER                   307511 non-null  object
 4   FLAG_OWN_CAR                  307511 non-null  object
 5   FLAG_OWN_REALTY               307511 non-null  object
 6   CNT_CHILDREN                  307511 non-null  int64
 7   AMT_INCOME_TOTAL              307511 non-null  float64
 8   AMT_CREDIT                    307511 non-null  float64
 9   AMT_ANNUITY                   307499 non-null  float64
 10  AMT_GOODS_PRICE               307233 non-null  float64
 11  NAME_TYPE_SUITE               306219 non-null  object
 12  NAME_INCOME_TYPE              307511 non-null  object
 13  NAME_EDUCATION_TYPE           307511 non-null  object
 14  NAME_FAMILY_STATUS            307511 non-null  object
 15  NAME_HOUSING_TYPE             307511 non-null  object
 16  REGION_POPULATION_RELATIVE    307511 non-null  float64
 17  DAYS_BIRTH                    307511 non-null  int64
 18  DAYS_EMPLOYED                 307511 non-null  int64
 19  DAYS_REGISTRATION             307511 non-null  float64
 20  DAYS_ID_PUBLISH               307511 non-null  int64
 21  FLAG_MOBIL                    307511 non-null  int64
 22  FLAG_EMP_PHONE                307511 non-null  int64
 23  FLAG_WORK_PHONE               307511 non-null  int64
 24  FLAG_CONT_MOBILE              307511 non-null  int64
 25  FLAG_PHONE                    307511 non-null  int64
 26  FLAG_EMAIL                    307511 non-null  int64
 27  OCCUPATION_TYPE               211120 non-null  object
 28  CNT_FAM_MEMBERS               307509 non-null  float64
 29  REGION_RATING_CLIENT          307511 non-null  int64
 30  REGION_RATING_CLIENT_W_CITY   307511 non-null  int64
 31  WEEKDAY_APPR_PROCESS_START    307511 non-null  object
 32  HOUR_APPR_PROCESS_START       307511 non-null  int64
 33  REG_REGION_NOT_LIVE_REGION    307511 non-null  int64
 34  REG_REGION_NOT_WORK_REGION    307511 non-null  int64
 35  LIVE_REGION_NOT_WORK_REGION   307511 non-null  int64
 36  REG_CITY_NOT_LIVE_CITY        307511 non-null  int64
 37  REG_CITY_NOT_WORK_CITY        307511 non-null  int64
 38  LIVE_CITY_NOT_WORK_CITY       307511 non-null  int64
 39  ORGANIZATION_TYPE             307511 non-null  object
 40  EXT_SOURCE_2                  306851 non-null  float64
 41  EXT_SOURCE_3                  246546 non-null  float64
 42  YEARS_BEGINEXPLUATATION_AVG   157504 non-null  float64
 43  FLOORSMAX_AVG                 154491 non-null  float64
 44  YEARS_BEGINEXPLUATATION_MODE  157504 non-null  float64
 45  FLOORSMAX_MODE                154491 non-null  float64
 46  YEARS_BEGINEXPLUATATION_MEDI  157504 non-null  float64
 47  FLOORSMAX_MEDI                154491 non-null  float64
 48  TOTALAREA_MODE                159080 non-null  float64
 49  EMERGENCYSTATE_MODE           161756 non-null  object
 50  OBS_30_CNT_SOCIAL_CIRCLE      306490 non-null  float64
 51  DEF_30_CNT_SOCIAL_CIRCLE      306490 non-null  float64
 52  OBS_60_CNT_SOCIAL_CIRCLE      306490 non-null  float64
 53  DEF_60_CNT_SOCIAL_CIRCLE      306490 non-null  float64
 54  DAYS_LAST_PHONE_CHANGE        307510 non-null  float64
 55  FLAG_DOCUMENT_2               307511 non-null  int64
 56  FLAG_DOCUMENT_3               307511 non-null  int64
 57  FLAG_DOCUMENT_4               307511 non-null  int64
 58  FLAG_DOCUMENT_5               307511 non-null  int64
 59  FLAG_DOCUMENT_6               307511 non-null  int64
 60  FLAG_DOCUMENT_7               307511 non-null  int64
 61  FLAG_DOCUMENT_8               307511 non-null  int64
 62  FLAG_DOCUMENT_9               307511 non-null  int64
 63  FLAG_DOCUMENT_10              307511 non-null  int64
 64  FLAG_DOCUMENT_11              307511 non-null  int64
 65  FLAG_DOCUMENT_12              307511 non-null  int64
 66  FLAG_DOCUMENT_13              307511 non-null  int64
 67  FLAG_DOCUMENT_14              307511 non-null  int64
 68  FLAG_DOCUMENT_15              307511 non-null  int64
 69  FLAG_DOCUMENT_16              307511 non-null  int64
 70  FLAG_DOCUMENT_17              307511 non-null  int64
 71  FLAG_DOCUMENT_18              307511 non-null  int64
 72  FLAG_DOCUMENT_19              307511 non-null  int64
 73  FLAG_DOCUMENT_20              307511 non-null  int64
 74  FLAG_DOCUMENT_21              307511 non-null  int64
 75  AMT_REQ_CREDIT_BUREAU_HOUR    265992 non-null  float64
 76  AMT_REQ_CREDIT_BUREAU_DAY     265992 non-null  float64
 77  AMT_REQ_CREDIT_BUREAU_WEEK    265992 non-null  float64
 78  AMT_REQ_CREDIT_BUREAU_MON     265992 non-null  float64
 79  AMT_REQ_CREDIT_BUREAU_QRT     265992 non-null  float64
 80  AMT_REQ_CREDIT_BUREAU_YEAR    265992 non-null  float64
dtypes: float64(27), int64(41), object(13)
memory usage: 190.0+ MB

In [7]:
train.select_dtypes(include='object').isnull().sum().sort_values(ascending=False)

EMERGENCYSTATE_MODE           145755
OCCUPATION_TYPE                96391
NAME_TYPE_SUITE                 1292
NAME_CONTRACT_TYPE                 0
CODE_GENDER                        0
FLAG_OWN_CAR                       0
FLAG_OWN_REALTY                    0
NAME_INCOME_TYPE                   0
NAME_EDUCATION_TYPE                0
NAME_FAMILY_STATUS                 0
NAME_HOUSING_TYPE                  0
WEEKDAY_APPR_PROCESS_START         0
ORGANIZATION_TYPE                  0
dtype: int64

### Filling Category Nulls

In [8]:
train

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
307506,456251,0,Cash loans,M,N,N,0,157500.0,254700.0,27558.0,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307507,456252,0,Cash loans,F,N,Y,0,72000.0,269550.0,12001.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307508,456253,0,Cash loans,F,N,Y,0,153000.0,677664.0,29979.0,...,0,0,0,0,1.0,0.0,0.0,1.0,0.0,1.0
307509,456254,1,Cash loans,F,N,Y,0,171000.0,370107.0,20205.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
307510,456255,0,Cash loans,F,N,N,0,157500.0,675000.0,49117.5,...,0,0,0,0,0.0,0.0,0.0,2.0,0.0,1.0

#### EMERGENCYSTATE_MODE

In [9]:
train['EMERGENCYSTATE_MODE'].value_counts(dropna=False)

EMERGENCYSTATE_MODE
No     159428
NaN    145755
Yes      2328
Name: count, dtype: int64

In [10]:
train['EMERGENCYSTATE_MODE'] = np.where(train['EMERGENCYSTATE_MODE'].isnull(), train['EMERGENCYSTATE_MODE'].mode(), train['EMERGENCYSTATE_MODE'])
train['EMERGENCYSTATE_MODE'].isnull().sum()

0

#### OCCUPATION_TYPE

In [11]:
train['OCCUPATION_TYPE'].value_counts(dropna=False)

OCCUPATION_TYPE
NaN                      96391
Laborers                 55186
Sales staff              32102
Core staff               27570
Managers                 21371
Drivers                  18603
High skill tech staff    11380
Accountants               9813
Medicine staff            8537
Security staff            6721
Cooking staff             5946
Cleaning staff            4653
Private service staff     2652
Low-skill Laborers        2093
Waiters/barmen staff      1348
Secretaries               1305
Realty agents              751
HR staff                   563
IT staff                   526
Name: count, dtype: int64

In [12]:
train['NAME_EDUCATION_TYPE'].value_counts()

NAME_EDUCATION_TYPE
Secondary / secondary special    218391
Higher education                  74863
Incomplete higher                 10277
Lower secondary                    3816
Academic degree                     164
Name: count, dtype: int64

In [13]:
train['OCCUPATION_TYPE'] = train.groupby('NAME_EDUCATION_TYPE')['OCCUPATION_TYPE'].transform(lambda x: x.fillna(x.mode()).iloc[0])
train['OCCUPATION_TYPE'].isnull().sum()

3816

In [14]:
train['OCCUPATION_TYPE'] = train.groupby('ORGANIZATION_TYPE')['OCCUPATION_TYPE'].transform(lambda x: x.fillna(x.mode()).iloc[0])
train['OCCUPATION_TYPE'].isnull().sum()

0

#### NAME_TYPE_SUITE

In [15]:
train['NAME_TYPE_SUITE'].value_counts(dropna=False)

NAME_TYPE_SUITE
Unaccompanied      248526
Family              40149
Spouse, partner     11370
Children             3267
Other_B              1770
NaN                  1292
Other_A               866
Group of people       271
Name: count, dtype: int64

In [16]:
train['NAME_TYPE_SUITE'] = train.groupby('NAME_FAMILY_STATUS')['NAME_TYPE_SUITE'].transform(lambda x: x.fillna(x.mode()).iloc[0])
train['NAME_TYPE_SUITE'].isnull().sum()

2

In [17]:
train['NAME_TYPE_SUITE'] = np.where(train['NAME_TYPE_SUITE'].isnull(), train['NAME_TYPE_SUITE'].mode(), train['NAME_TYPE_SUITE'])
train['NAME_TYPE_SUITE'].isnull().sum()

0

#### NAME_EDUCATION_TYPE

In [18]:
train['NAME_EDUCATION_TYPE'] = np.where(train['NAME_EDUCATION_TYPE']=='Secondary / secondary special', 'Secondary', train['NAME_EDUCATION_TYPE'])

### Filling Numerical Nulls

In [19]:
pd.set_option('display.max_rows', None)
train.select_dtypes(include=('int', 'float')).isnull().sum().sort_values(ascending=False)

FLOORSMAX_MEDI                  153020
FLOORSMAX_MODE                  153020
FLOORSMAX_AVG                   153020
YEARS_BEGINEXPLUATATION_MEDI    150007
YEARS_BEGINEXPLUATATION_MODE    150007
YEARS_BEGINEXPLUATATION_AVG     150007
TOTALAREA_MODE                  148431
EXT_SOURCE_3                     60965
AMT_REQ_CREDIT_BUREAU_QRT        41519
AMT_REQ_CREDIT_BUREAU_MON        41519
AMT_REQ_CREDIT_BUREAU_WEEK       41519
AMT_REQ_CREDIT_BUREAU_DAY        41519
AMT_REQ_CREDIT_BUREAU_HOUR       41519
AMT_REQ_CREDIT_BUREAU_YEAR       41519
OBS_60_CNT_SOCIAL_CIRCLE          1021
DEF_30_CNT_SOCIAL_CIRCLE          1021
OBS_30_CNT_SOCIAL_CIRCLE          1021
DEF_60_CNT_SOCIAL_CIRCLE          1021
EXT_SOURCE_2                       660
AMT_GOODS_PRICE                    278
AMT_ANNUITY                         12
CNT_FAM_MEMBERS                      2
DAYS_LAST_PHONE_CHANGE               1
FLAG_DOCUMENT_13                     0
FLAG_DOCUMENT_7                      0
FLAG_DOCUMENT_8                      0
FLAG_DOCUMENT_9                      0
FLAG_DOCUMENT_10                     0
FLAG_DOCUMENT_6                      0
FLAG_DOCUMENT_11                     0
FLAG_DOCUMENT_12                     0
FLAG_DOCUMENT_15                     0
FLAG_DOCUMENT_14                     0
FLAG_DOCUMENT_4                      0
FLAG_DOCUMENT_16                     0
FLAG_DOCUMENT_17                     0
FLAG_DOCUMENT_18                     0
FLAG_DOCUMENT_19                     0
FLAG_DOCUMENT_20                     0
FLAG_DOCUMENT_21                     0
AMT_CREDIT                           0
AMT_INCOME_TOTAL                     0
CNT_CHILDREN                         0
FLAG_DOCUMENT_5                      0
FLAG_WORK_PHONE                      0
FLAG_DOCUMENT_3                      0
REG_CITY_NOT_WORK_CITY               0
FLAG_PHONE                           0
FLAG_EMAIL                           0
REGION_RATING_CLIENT                 0
REGION_RATING_CLIENT_W_CITY          0
HOUR_APPR_PROCESS_START              0
REG_REGION_NOT_LIVE_REGION           0
REG_REGION_NOT_WORK_REGION           0
LIVE_REGION_NOT_WORK_REGION          0
REG_CITY_NOT_LIVE_CITY               0
LIVE_CITY_NOT_WORK_CITY              0
FLAG_DOCUMENT_2                      0
FLAG_EMP_PHONE                       0
FLAG_MOBIL                           0
DAYS_ID_PUBLISH                      0
DAYS_REGISTRATION                    0
DAYS_EMPLOYED                        0
TARGET                               0
DAYS_BIRTH                           0
REGION_POPULATION_RELATIVE           0
FLAG_CONT_MOBILE                     0
SK_ID_CURR                           0
dtype: int64

In [20]:
pd.reset_option('display.max_rows')

#### FLOORSMAX_MEDI

In [21]:
train['FLOORSMAX_MEDI'].value_counts()

FLOORSMAX_MEDI
0.1667    63607
0.3333    33279
0.0417    14832
0.3750     8207
0.1250     7079
0.0833     6657
0.4583     3089
0.0000     2995
0.6250     2042
0.5417     1860
0.2500     1684
0.6667     1675
0.2083     1544
0.2917      567
0.1042      460
0.3542      459
0.5833      439
0.3958      346
0.4167      329
0.1458      321
0.5000      312
0.2708      291
0.1875      245
0.8750      223
0.4792      220
0.7083      204
1.0000      170
0.4375      138
0.7500      136
0.0625      132
0.3125      131
0.2292      128
0.0208      126
0.6042      115
0.9583       95
0.7917       61
0.5208       47
0.5625       46
0.8333       39
0.9167       37
0.6458       30
0.7708       27
0.6875       24
0.8125       23
0.7292       10
0.9375        4
0.8542        3
0.8958        2
0.9792        1
Name: count, dtype: int64

In [22]:
train['FLOORSMAX_MEDI'] = np.where(train['FLOORSMAX_MEDI'].isnull(), train['FLOORSMAX_MEDI'].mean(), train['FLOORSMAX_MEDI'])
train['FLOORSMAX_MEDI'].isnull().sum()

0

#### FLOORSMAX_MODE

In [23]:
train['FLOORSMAX_MODE'].value_counts(dropna=False)

FLOORSMAX_MODE
NaN       153020
0.1667     65550
0.3333     34373
0.0417     15616
0.3750      8321
0.1250      7267
0.0833      6785
0.0000      3415
0.4583      3216
0.6250      2075
0.5417      1836
0.6667      1710
0.2083      1505
0.2500       572
0.2917       511
0.5833       391
0.4167       236
0.8750       229
0.7083       199
0.5000       184
1.0000       164
0.7500       124
0.9583        94
0.7917        58
0.9167        38
0.8333        22
Name: count, dtype: int64

In [24]:
train['FLOORSMAX_MODE'] = np.where(train['FLOORSMAX_MODE'].isnull(), train['FLOORSMAX_MODE'].mode(), train['FLOORSMAX_MODE'])
train['FLOORSMAX_MODE'].isnull().sum()

0

#### FLOORSMAX_AVG

In [25]:
train['FLOORSMAX_AVG'].value_counts(dropna=False)

FLOORSMAX_AVG
NaN       153020
0.1667     61875
0.3333     31909
0.0417     14600
0.3750      7926
           ...
0.1792         1
0.2200         1
0.1133         1
0.0900         1
0.2042         1
Name: count, Length: 404, dtype: int64

In [26]:
train['FLOORSMAX_AVG'].mean()

0.22628190703665588

In [27]:
train['FLOORSMAX_AVG'] = np.where(train['FLOORSMAX_AVG'].isnull(), train['FLOORSMAX_AVG'].mean(), train['FLOORSMAX_AVG'])
train['FLOORSMAX_AVG'].isnull().sum()

0

#### YEARS_BEGINEXPLUATATION_MEDI

In [28]:
train['YEARS_BEGINEXPLUATATION_MEDI'] = np.where(train['YEARS_BEGINEXPLUATATION_MEDI'].isnull(), train['YEARS_BEGINEXPLUATATION_MEDI'].mean(), train['YEARS_BEGINEXPLUATATION_MEDI'])
train['YEARS_BEGINEXPLUATATION_MEDI'].isnull().sum()

0

#### YEARS_BEGINEXPLUATATION_MODE

In [29]:
train['YEARS_BEGINEXPLUATATION_MODE'] = np.where(train['YEARS_BEGINEXPLUATATION_MODE'].isnull(), train['YEARS_BEGINEXPLUATATION_MODE'].mode(), train['YEARS_BEGINEXPLUATATION_MODE'])
train['YEARS_BEGINEXPLUATATION_MODE'].isnull().sum()

0

#### YEARS_BEGINEXPLUATATION_AVG

In [30]:
train['YEARS_BEGINEXPLUATATION_AVG'] = np.where(train['YEARS_BEGINEXPLUATATION_AVG'].isnull(), train['YEARS_BEGINEXPLUATATION_AVG'].mean(), train['YEARS_BEGINEXPLUATATION_AVG'])
train['YEARS_BEGINEXPLUATATION_AVG'].isnull().sum()

0

#### TOTALAREA_MODE

In [31]:
train['TOTALAREA_MODE'].value_counts()

TOTALAREA_MODE
0.0000    582
0.0570    247
0.0547    230
0.0550    227
0.0555    227
         ...
0.3445      1
0.2894      1
0.8712      1
0.5775      1
0.7970      1
Name: count, Length: 5116, dtype: int64

In [32]:
train['TOTALAREA_MODE'] = train.groupby('NAME_HOUSING_TYPE')['TOTALAREA_MODE'].transform(lambda x: x.fillna(x.mode()).iloc[0])
train['TOTALAREA_MODE'].isnull().sum()

18681

In [33]:
train['TOTALAREA_MODE'] = np.where(train['TOTALAREA_MODE'].isnull(), train['TOTALAREA_MODE'].mode(), train['TOTALAREA_MODE'])
train['TOTALAREA_MODE'].isnull().sum()

0

#### EXT_SOURCE_3

In [34]:
train['EXT_SOURCE_3'].value_counts(dropna=False)

EXT_SOURCE_3
NaN         60965
0.746300     1460
0.713631     1315
0.694093     1276
0.670652     1191
            ...
0.028674        1
0.025272        1
0.021492        1
0.014556        1
0.043227        1
Name: count, Length: 815, dtype: int64

In [35]:
train['EXT_SOURCE_3'] = np.where(train['EXT_SOURCE_3'].isnull(), train['EXT_SOURCE_3'].mean(), train['EXT_SOURCE_3'])
train['EXT_SOURCE_3'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_QRT

In [36]:
train['AMT_REQ_CREDIT_BUREAU_QRT'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_QRT
0.0      215417
NaN       41519
1.0       33862
2.0       14412
3.0        1717
4.0         476
5.0          64
6.0          28
8.0           7
7.0           7
261.0         1
19.0          1
Name: count, dtype: int64

In [37]:
train['AMT_REQ_CREDIT_BUREAU_QRT'] = np.where(train['AMT_REQ_CREDIT_BUREAU_QRT'].isnull(), train['AMT_REQ_CREDIT_BUREAU_QRT'].mode(), train['AMT_REQ_CREDIT_BUREAU_QRT'])
train['AMT_REQ_CREDIT_BUREAU_QRT'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_MON

In [38]:
train['AMT_REQ_CREDIT_BUREAU_MON'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_MON
0.0     222233
NaN      41519
1.0      33147
2.0       5386
3.0       1991
4.0       1076
5.0        602
6.0        343
7.0        298
9.0        206
8.0        185
10.0       132
11.0       119
12.0        77
13.0        72
14.0        40
15.0        35
16.0        23
17.0        14
18.0         6
19.0         3
24.0         1
23.0         1
27.0         1
22.0         1
Name: count, dtype: int64

In [39]:
train['AMT_REQ_CREDIT_BUREAU_MON'] = np.where(train['AMT_REQ_CREDIT_BUREAU_MON'].isnull(), train['AMT_REQ_CREDIT_BUREAU_MON'].mode(), train['AMT_REQ_CREDIT_BUREAU_MON'])
train['AMT_REQ_CREDIT_BUREAU_MON'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_WEEK

In [40]:
train['AMT_REQ_CREDIT_BUREAU_WEEK'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_WEEK
0.0    257456
NaN     41519
1.0      8208
2.0       199
3.0        58
4.0        34
6.0        20
5.0        10
8.0         5
7.0         2
Name: count, dtype: int64

In [41]:
train['AMT_REQ_CREDIT_BUREAU_WEEK'] = np.where(train['AMT_REQ_CREDIT_BUREAU_WEEK'].isnull(), train['AMT_REQ_CREDIT_BUREAU_WEEK'].mode(), train['AMT_REQ_CREDIT_BUREAU_WEEK'])
train['AMT_REQ_CREDIT_BUREAU_WEEK'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_DAY

In [42]:
train['AMT_REQ_CREDIT_BUREAU_DAY'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_DAY
0.0    264503
NaN     41519
1.0      1292
2.0       106
3.0        45
4.0        26
5.0         9
6.0         8
9.0         2
8.0         1
Name: count, dtype: int64

In [43]:
train['AMT_REQ_CREDIT_BUREAU_DAY'] = np.where(train['AMT_REQ_CREDIT_BUREAU_DAY'].isnull(), train['AMT_REQ_CREDIT_BUREAU_DAY'].mode(), train['AMT_REQ_CREDIT_BUREAU_DAY'])
train['AMT_REQ_CREDIT_BUREAU_DAY'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_HOUR

In [44]:
train['AMT_REQ_CREDIT_BUREAU_HOUR'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_HOUR
0.0    264366
NaN     41519
1.0      1560
2.0        56
3.0         9
4.0         1
Name: count, dtype: int64

In [45]:
train['AMT_REQ_CREDIT_BUREAU_HOUR'] = np.where(train['AMT_REQ_CREDIT_BUREAU_HOUR'].isnull(), train['AMT_REQ_CREDIT_BUREAU_HOUR'].mode(), train['AMT_REQ_CREDIT_BUREAU_HOUR'])
train['AMT_REQ_CREDIT_BUREAU_HOUR'].isnull().sum()

0

#### AMT_REQ_CREDIT_BUREAU_YEAR

In [46]:
train['AMT_REQ_CREDIT_BUREAU_YEAR'].value_counts(dropna=False)

AMT_REQ_CREDIT_BUREAU_YEAR
0.0     71801
1.0     63405
2.0     50192
NaN     41519
3.0     33628
4.0     20714
5.0     12052
6.0      6967
7.0      3869
8.0      2127
9.0      1096
11.0       31
12.0       30
10.0       22
13.0       19
14.0       10
17.0        7
15.0        6
19.0        4
18.0        4
16.0        3
25.0        1
23.0        1
22.0        1
21.0        1
20.0        1
Name: count, dtype: int64

In [47]:
train['AMT_REQ_CREDIT_BUREAU_YEAR'] = np.where(train['AMT_REQ_CREDIT_BUREAU_YEAR'].isnull(), train['AMT_REQ_CREDIT_BUREAU_YEAR'].mode(), train['AMT_REQ_CREDIT_BUREAU_YEAR'])
train['AMT_REQ_CREDIT_BUREAU_YEAR'].isnull().sum()

0

#### OBS_60_CNT_SOCIAL_CIRCLE

In [48]:
train['OBS_60_CNT_SOCIAL_CIRCLE'].value_counts(dropna=False)

OBS_60_CNT_SOCIAL_CIRCLE
0.0      164666
1.0       48870
2.0       29766
3.0       20215
4.0       13946
5.0        9463
6.0        6349
7.0        4344
8.0        2886
9.0        1959
10.0       1335
NaN        1021
11.0        837
12.0        620
13.0        401
14.0        238
15.0        166
16.0        137
17.0         73
18.0         49
19.0         44
20.0         30
21.0         28
22.0         20
23.0         13
24.0         12
25.0         11
27.0          5
29.0          2
28.0          1
47.0          1
344.0         1
30.0          1
26.0          1
Name: count, dtype: int64

In [49]:
train['OBS_60_CNT_SOCIAL_CIRCLE'] = np.where(train['OBS_60_CNT_SOCIAL_CIRCLE'].isnull(), train['OBS_60_CNT_SOCIAL_CIRCLE'].mode(), train['OBS_60_CNT_SOCIAL_CIRCLE'])
train['OBS_60_CNT_SOCIAL_CIRCLE'].isnull().sum()

0

#### DEF_30_CNT_SOCIAL_CIRCLE

In [50]:
train['DEF_30_CNT_SOCIAL_CIRCLE'].value_counts(dropna=False)

DEF_30_CNT_SOCIAL_CIRCLE
0.0     271324
1.0      28328
2.0       5323
3.0       1192
NaN       1021
4.0        253
5.0         56
6.0         11
7.0          1
34.0         1
8.0          1
Name: count, dtype: int64

In [51]:
train['DEF_30_CNT_SOCIAL_CIRCLE'] = np.where(train['DEF_30_CNT_SOCIAL_CIRCLE'].isnull(), train['DEF_30_CNT_SOCIAL_CIRCLE'].mode(), train['DEF_30_CNT_SOCIAL_CIRCLE'])
train['DEF_30_CNT_SOCIAL_CIRCLE'].isnull().sum()

0

#### OBS_30_CNT_SOCIAL_CIRCLE

In [52]:
train['OBS_30_CNT_SOCIAL_CIRCLE'].value_counts(dropna=False)

OBS_30_CNT_SOCIAL_CIRCLE
0.0      163910
1.0       48783
2.0       29808
3.0       20322
4.0       14143
5.0        9553
6.0        6453
7.0        4390
8.0        2967
9.0        2003
10.0       1376
NaN        1021
11.0        852
12.0        652
13.0        411
14.0        258
15.0        166
16.0        133
17.0         88
18.0         46
19.0         44
20.0         30
21.0         29
22.0         22
23.0         15
25.0         11
24.0         11
27.0          5
26.0          3
30.0          2
28.0          1
29.0          1
47.0          1
348.0         1
Name: count, dtype: int64

In [53]:
train['OBS_30_CNT_SOCIAL_CIRCLE'] = np.where(train['OBS_30_CNT_SOCIAL_CIRCLE'].isnull(), train['OBS_30_CNT_SOCIAL_CIRCLE'].mode(), train['OBS_30_CNT_SOCIAL_CIRCLE'])
train['OBS_30_CNT_SOCIAL_CIRCLE'].isnull().sum()

0

#### DEF_60_CNT_SOCIAL_CIRCLE

In [54]:
train['DEF_60_CNT_SOCIAL_CIRCLE'] = np.where(train['DEF_60_CNT_SOCIAL_CIRCLE'].isnull(), train['DEF_60_CNT_SOCIAL_CIRCLE'].mode(), train['DEF_60_CNT_SOCIAL_CIRCLE'])
train['DEF_60_CNT_SOCIAL_CIRCLE'].isnull().sum()

0

#### EXT_SOURCE_2

In [55]:
train['EXT_SOURCE_2'].value_counts(dropna=False)

EXT_SOURCE_2
0.285898    721
NaN         660
0.262258    417
0.265256    343
0.159679    322
           ...
0.004725      1
0.257313      1
0.282030      1
0.181540      1
0.267834      1
Name: count, Length: 119832, dtype: int64

In [56]:
train['EXT_SOURCE_2'] = np.where(train['EXT_SOURCE_2'].isnull(), train['EXT_SOURCE_2'].mean(), train['EXT_SOURCE_2'])
train['EXT_SOURCE_2'].isnull().sum()

0

#### AMT_GOODS_PRICE

In [57]:
train['AMT_GOODS_PRICE'].value_counts(dropna=False)

AMT_GOODS_PRICE
450000.0     26022
225000.0     25282
675000.0     24962
900000.0     15416
270000.0     11428
             ...
447606.0         1
2106000.0        1
894654.0         1
323982.0         1
743863.5         1
Name: count, Length: 1003, dtype: int64

In [58]:
train['AMT_GOODS_PRICE'] = np.where(train['AMT_GOODS_PRICE'].isnull(), train['AMT_GOODS_PRICE'].mean(), train['AMT_GOODS_PRICE'])
train['AMT_GOODS_PRICE'].isnull().sum()

0

In [59]:
train['AMT_GOODS_PRICE'] = train['AMT_GOODS_PRICE'].round(20)

#### AMT_ANNUITY

In [60]:
train['AMT_ANNUITY'].value_counts(dropna=False)

AMT_ANNUITY
9000.0      6385
13500.0     5514
6750.0      2279
10125.0     2035
37800.0     1602
            ...
79902.0        1
106969.5       1
60885.0        1
59661.0        1
77809.5        1
Name: count, Length: 13673, dtype: int64

In [61]:
train['AMT_ANNUITY'] = np.where(train['AMT_ANNUITY'].isnull(), train['AMT_ANNUITY'].mean(), train['AMT_ANNUITY'])
train['AMT_ANNUITY'].isnull().sum()

0

#### CNT_FAM_MEMBERS

In [62]:
train['CNT_FAM_MEMBERS'] = np.where(train['CNT_FAM_MEMBERS'].isnull(), train['CNT_FAM_MEMBERS'].mode(), train['CNT_FAM_MEMBERS'])
train['CNT_FAM_MEMBERS'].isnull().sum()

0

#### DAYS_LAST_PHONE_CHANGE

In [63]:
train['DAYS_LAST_PHONE_CHANGE'] = np.where(train['DAYS_LAST_PHONE_CHANGE'].isnull(), train['DAYS_LAST_PHONE_CHANGE'].mode(), train['DAYS_LAST_PHONE_CHANGE'])
train['DAYS_LAST_PHONE_CHANGE'].isnull().sum()

0

In [64]:
train.isnull().sum().sort_values(ascending=False)

SK_ID_CURR                    0
EXT_SOURCE_3                  0
FLAG_DOCUMENT_6               0
FLAG_DOCUMENT_5               0
FLAG_DOCUMENT_4               0
                             ..
FLAG_EMAIL                    0
FLAG_PHONE                    0
FLAG_CONT_MOBILE              0
FLAG_WORK_PHONE               0
AMT_REQ_CREDIT_BUREAU_YEAR    0
Length: 81, dtype: int64

# BUREAU BALANCE

In [65]:
bb = pd.read_csv(r'C:\Users\rvuon\OneDrive\Documents\Learning Fuze\database\Project Loan\home-credit-default-risk\bureau_balance.csv')
bb

          SK_ID_BUREAU  MONTHS_BALANCE STATUS
0              5715448               0      C
1              5715448              -1      C
2              5715448              -2      C
3              5715448              -3      C
4              5715448              -4      C
...                ...             ...    ...
27299920       5041336             -47      X
27299921       5041336             -48      X
27299922       5041336             -49      X
27299923       5041336             -50      X
27299924       5041336             -51      X

[27299925 rows x 3 columns]

In [66]:
bb.isnull().sum().sort_values(ascending=False)

SK_ID_BUREAU      0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

In [67]:
bb['STATUS'].value_counts()

STATUS
C    13646993
0     7499507
X     5810482
1      242347
5       62406
2       23419
3        8924
4        5847
Name: count, dtype: int64

# BUREAU

In [68]:
b = pd.read_csv(r'C:\Users\rvuon\OneDrive\Documents\Learning Fuze\database\Project Loan\home-credit-default-risk\bureau.csv')
b

,SK_ID_CURR,SK_ID_BUREAU,CREDIT_ACTIVE,CREDIT_CURRENCY,DAYS_CREDIT,CREDIT_DAY_OVERDUE,DAYS_CREDIT_ENDDATE,DAYS_ENDDATE_FACT,AMT_CREDIT_MAX_OVERDUE,CNT_CREDIT_PROLONG,AMT_CREDIT_SUM,AMT_CREDIT_SUM_DEBT,AMT_CREDIT_SUM_LIMIT,AMT_CREDIT_SUM_OVERDUE,CREDIT_TYPE,DAYS_CREDIT_UPDATE,AMT_ANNUITY
0,215354,5714462,Closed,currency 1,-497,0,-153.0,-153.0,NaN,0,91323.00,0.0,NaN,0.0,Consumer credit,-131,NaN
1,215354,5714463,Active,currency 1,-208,0,1075.0,NaN,NaN,0,225000.00,171342.0,NaN,0.0,Credit card,-20,NaN
2,215354,5714464,Active,currency 1,-203,0,528.0,NaN,NaN,0,464323.50,NaN,NaN,0.0,Consumer credit,-16,NaN
3,215354,5714465,Active,currency 1,-203,0,NaN,NaN,NaN,0,90000.00,NaN,NaN,0.0,Credit card,-16,NaN
4,215354,5714466,Active,currency 1,-629,0,1197.0,NaN,77674.5,0,2700000.00,NaN,NaN,0.0,Consumer credit,-21,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1716423,259355,5057750,Active,currency 1,-44,0,-30.0,NaN,0.0,0,11250.00,11250.0,0.0,0.0,Microloan,-19,NaN
1716424,100044,5057754,Closed,currency 1,-2648,0,-2433.0,-2493.0,5476.5,0,38130.84,0.0,0.0,0.0,Consumer credit,-2493,NaN
1716425,100044,5057762,Closed,currency 1,-1809,0,-1628.0,-970.0,NaN,0,15570.00,NaN,NaN,0.0,Consumer credit,-967,NaN
1716426,246829,5057770,Closed,currency 1,-1878,0,-1513.0,-1513.0,NaN,0,36000.00,0.0,0.0,0.0,Consumer credit,-1508,NaN
1716427,246829,5057778,Closed,currency 1,-463,0,NaN,-387.0,NaN,0,22500.00,0.0,NaN,0.0,Microloan,-387,NaN

In [69]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1716428 entries, 0 to 1716427
Data columns (total 17 columns):
 #   Column                  Dtype
---  ------                  -----
 0   SK_ID_CURR              int64
 1   SK_ID_BUREAU            int64
 2   CREDIT_ACTIVE           object
 3   CREDIT_CURRENCY         object
 4   DAYS_CREDIT             int64
 5   CREDIT_DAY_OVERDUE      int64
 6   DAYS_CREDIT_ENDDATE     float64
 7   DAYS_ENDDATE_FACT       float64
 8   AMT_CREDIT_MAX_OVERDUE  float64
 9   CNT_CREDIT_PROLONG      int64
 10  AMT_CREDIT_SUM          float64
 11  AMT_CREDIT_SUM_DEBT     float64
 12  AMT_CREDIT_SUM_LIMIT    float64
 13  AMT_CREDIT_SUM_OVERDUE  float64
 14  CREDIT_TYPE             object
 15  DAYS_CREDIT_UPDATE      int64
 16  AMT_ANNUITY             float64
dtypes: float64(8), int64(6), object(3)
memory usage: 222.6+ MB

In [70]:
b.isnull().sum().sort_values(ascending=False)

AMT_ANNUITY               1226791
AMT_CREDIT_MAX_OVERDUE    1124488
DAYS_ENDDATE_FACT          633653
AMT_CREDIT_SUM_LIMIT       591780
AMT_CREDIT_SUM_DEBT        257669
DAYS_CREDIT_ENDDATE        105553
AMT_CREDIT_SUM                 13
CREDIT_ACTIVE                   0
CREDIT_CURRENCY                 0
DAYS_CREDIT                     0
CREDIT_DAY_OVERDUE              0
SK_ID_BUREAU                    0
CNT_CREDIT_PROLONG              0
AMT_CREDIT_SUM_OVERDUE          0
CREDIT_TYPE                     0
DAYS_CREDIT_UPDATE              0
SK_ID_CURR                      0
dtype: int64

## Data Cleaning

In [71]:
duplicates = b.duplicated()
b[duplicates]

Empty DataFrame
Columns: [SK_ID_CURR, SK_ID_BUREAU, CREDIT_ACTIVE, CREDIT_CURRENCY, DAYS_CREDIT, CREDIT_DAY_OVERDUE, DAYS_CREDIT_ENDDATE, DAYS_ENDDATE_FACT, AMT_CREDIT_MAX_OVERDUE, CNT_CREDIT_PROLONG, AMT_CREDIT_SUM, AMT_CREDIT_SUM_DEBT, AMT_CREDIT_SUM_LIMIT, AMT_CREDIT_SUM_OVERDUE, CREDIT_TYPE, DAYS_CREDIT_UPDATE, AMT_ANNUITY]
Index: []

In [72]:
def fraction_missing(column):
    total_rows = len(column)
    missing_count = column.isnull().sum()
    return missing_count/total_rows

missing_fraction = b.apply(fraction_missing)
missing_fraction

SK_ID_CURR                0.000000
SK_ID_BUREAU              0.000000
CREDIT_ACTIVE             0.000000
CREDIT_CURRENCY           0.000000
DAYS_CREDIT               0.000000
CREDIT_DAY_OVERDUE        0.000000
DAYS_CREDIT_ENDDATE       0.061496
DAYS_ENDDATE_FACT         0.369170
AMT_CREDIT_MAX_OVERDUE    0.655133
CNT_CREDIT_PROLONG        0.000000
AMT_CREDIT_SUM            0.000008
AMT_CREDIT_SUM_DEBT       0.150119
AMT_CREDIT_SUM_LIMIT      0.344774
AMT_CREDIT_SUM_OVERDUE    0.000000
CREDIT_TYPE               0.000000
DAYS_CREDIT_UPDATE        0.000000
AMT_ANNUITY               0.714735
dtype: float64

In [73]:
high_missing_features_b = missing_fraction[missing_fraction > 0.5]
high_missing_features_b = high_missing_features_b.sort_values(ascending=False)
high_missing_features_b

AMT_ANNUITY               0.714735
AMT_CREDIT_MAX_OVERDUE    0.655133
dtype: float64

In [74]:
b.select_dtypes(include='object').isnull().sum().sort_values(ascending=False)

CREDIT_ACTIVE      0
CREDIT_CURRENCY    0
CREDIT_TYPE        0
dtype: int64

In [75]:
b.select_dtypes(include=('int', 'float')).isnull().sum().sort_values(ascending=False)

AMT_ANNUITY               1226791
AMT_CREDIT_MAX_OVERDUE    1124488
DAYS_ENDDATE_FACT          633653
AMT_CREDIT_SUM_LIMIT       591780
AMT_CREDIT_SUM_DEBT        257669
DAYS_CREDIT_ENDDATE        105553
AMT_CREDIT_SUM                 13
SK_ID_CURR                      0
SK_ID_BUREAU                    0
DAYS_CREDIT                     0
CREDIT_DAY_OVERDUE              0
CNT_CREDIT_PROLONG              0
AMT_CREDIT_SUM_OVERDUE          0
DAYS_CREDIT_UPDATE              0
dtype: int64

### Fill Numerical Nulls

#### AMT_ANNUITY

In [76]:
b['AMT_ANNUITY'].value_counts(dropna=False)

AMT_ANNUITY
NaN           1226791
0.000          256915
4500.000         5182
13500.000        3147
22500.000        2502
               ...
21228.750           1
7263.270            1
49215.015           1
144405.000          1
24351.435           1
Name: count, Length: 40322, dtype: int64

In [77]:
b.groupby('CREDIT_TYPE')['AMT_ANNUITY'].mean()

CREDIT_TYPE
Another type of loan                            30619.190593
Car loan                                        33889.117467
Cash loan (non-earmarked)                       16102.715294
Consumer credit                                 15389.301249
Credit card                                     12379.794494
Interbank credit                                         NaN
Loan for business development                   39319.372875
Loan for purchase of shares (margin lending)    46868.490000
Loan for the purchase of equipment              31635.855000
Loan for working capital replenishment          17103.931216
Microloan                                        7966.019973
Mobile operator loan                             4054.500000
Mortgage                                        69662.136225
Real estate loan                                17786.970000
Unknown type of loan                            20592.980722
Name: AMT_ANNUITY, dtype: float64

In [78]:
b['AMT_ANNUITY'] = b.groupby('CREDIT_TYPE')['AMT_ANNUITY'].transform(lambda x: x.fillna(x.mean()))
b['AMT_ANNUITY'].isnull().sum()

1

In [79]:
b['AMT_ANNUITY'] = np.where(b['AMT_ANNUITY'].isnull(), b['AMT_ANNUITY'].mean(), b['AMT_ANNUITY'])
b['AMT_ANNUITY'].isnull().sum()

0

#### AMT_CREDIT_MAX_OVERDUE

In [80]:
b['AMT_CREDIT_MAX_OVERDUE'].value_counts(dropna=False)

AMT_CREDIT_MAX_OVERDUE
NaN          1124488
0.000         470650
1440.000         688
225.000          405
45.000           377
              ...
38506.500          1
47700.000          1
4093.470           1
4009.140           1
5693.625           1
Name: count, Length: 68252, dtype: int64

In [81]:
b[b['AMT_CREDIT_MAX_OVERDUE']==0]

,SK_ID_CURR,SK_ID_BUREAU,CREDIT_ACTIVE,CREDIT_CURRENCY,DAYS_CREDIT,CREDIT_DAY_OVERDUE,DAYS_CREDIT_ENDDATE,DAYS_ENDDATE_FACT,AMT_CREDIT_MAX_OVERDUE,CNT_CREDIT_PROLONG,AMT_CREDIT_SUM,AMT_CREDIT_SUM_DEBT,AMT_CREDIT_SUM_LIMIT,AMT_CREDIT_SUM_OVERDUE,CREDIT_TYPE,DAYS_CREDIT_UPDATE,AMT_ANNUITY
5,215354,5714467,Active,currency 1,-273,0,27460.0,NaN,0.0,0,180000.000,71017.38,108982.62,0.0,Credit card,-31,12379.794494
6,215354,5714468,Active,currency 1,-43,0,79.0,NaN,0.0,0,42103.800,42103.80,0.00,0.0,Consumer credit,-22,15389.301249
8,162297,5714470,Closed,currency 1,-1146,0,-811.0,-840.0,0.0,0,103007.700,0.00,0.00,0.0,Consumer credit,-840,15389.301249
9,162297,5714471,Active,currency 1,-1146,0,-484.0,NaN,0.0,0,4500.000,0.00,0.00,0.0,Credit card,-690,12379.794494
10,162297,5714472,Active,currency 1,-1146,0,-180.0,NaN,0.0,0,337500.000,0.00,0.00,0.0,Credit card,-690,12379.794494
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1716406,335468,5057618,Closed,currency 1,-2517,0,-660.0,-2363.0,0.0,0,473940.000,0.00,0.00,0.0,Car loan,-2363,33889.117467
1716409,146896,5057636,Closed,currency 1,-1705,0,-582.0,-582.0,0.0,0,0.000,0.00,0.00,0.0,Credit card,-582,12379.794494
1716411,232118,5057652,Closed,currency 1,-821,0,-425.0,-545.0,0.0,0,108765.720,0.00,0.00,0.0,Consumer credit,-545,15389.301249
1716418,433007,5057708,Closed,currency 1,-1389,0,-1299.0,-1299.0,0.0,0,334158.435,0.00,0.00,0.0,Consumer credit,-1299,15389.301249
1716423,259355,5057750,Active,currency 1,-44,0,-30.0,NaN,0.0,0,11250.000,11250.00,0.00,0.0,Microloan,-19,7966.019973

In [82]:
b[b['AMT_CREDIT_SUM_OVERDUE']==0]

,SK_ID_CURR,SK_ID_BUREAU,CREDIT_ACTIVE,CREDIT_CURRENCY,DAYS_CREDIT,CREDIT_DAY_OVERDUE,DAYS_CREDIT_ENDDATE,DAYS_ENDDATE_FACT,AMT_CREDIT_MAX_OVERDUE,CNT_CREDIT_PROLONG,AMT_CREDIT_SUM,AMT_CREDIT_SUM_DEBT,AMT_CREDIT_SUM_LIMIT,AMT_CREDIT_SUM_OVERDUE,CREDIT_TYPE,DAYS_CREDIT_UPDATE,AMT_ANNUITY
0,215354,5714462,Closed,currency 1,-497,0,-153.0,-153.0,NaN,0,91323.00,0.0,NaN,0.0,Consumer credit,-131,15389.301249
1,215354,5714463,Active,currency 1,-208,0,1075.0,NaN,NaN,0,225000.00,171342.0,NaN,0.0,Credit card,-20,12379.794494
2,215354,5714464,Active,currency 1,-203,0,528.0,NaN,NaN,0,464323.50,NaN,NaN,0.0,Consumer credit,-16,15389.301249
3,215354,5714465,Active,currency 1,-203,0,NaN,NaN,NaN,0,90000.00,NaN,NaN,0.0,Credit card,-16,12379.794494
4,215354,5714466,Active,currency 1,-629,0,1197.0,NaN,77674.5,0,2700000.00,NaN,NaN,0.0,Consumer credit,-21,15389.301249
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1716423,259355,5057750,Active,currency 1,-44,0,-30.0,NaN,0.0,0,11250.00,11250.0,0.0,0.0,Microloan,-19,7966.019973
1716424,100044,5057754,Closed,currency 1,-2648,0,-2433.0,-2493.0,5476.5,0,38130.84,0.0,0.0,0.0,Consumer credit,-2493,15389.301249
1716425,100044,5057762,Closed,currency 1,-1809,0,-1628.0,-970.0,NaN,0,15570.00,NaN,NaN,0.0,Consumer credit,-967,15389.301249
1716426,246829,5057770,Closed,currency 1,-1878,0,-1513.0,-1513.0,NaN,0,36000.00,0.0,0.0,0.0,Consumer credit,-1508,15389.301249
1716427,246829,5057778,Closed,currency 1,-463,0,NaN,-387.0,NaN,0,22500.00,0.0,NaN,0.0,Microloan,-387,7966.019973

In [83]:
b['AMT_CREDIT_MAX_OVERDUE'] = np.where((b['AMT_CREDIT_MAX_OVERDUE'].isnull()) & (b['AMT_CREDIT_SUM_OVERDUE']==0.0), 0, b['AMT_CREDIT_MAX_OVERDUE'])
b['AMT_CREDIT_MAX_OVERDUE'].isnull().sum()

3409

In [84]:
b['AMT_CREDIT_MAX_OVERDUE'] = np.where(b['AMT_CREDIT_MAX_OVERDUE'].isnull(), b['AMT_CREDIT_MAX_OVERDUE'].mean(), b['AMT_CREDIT_MAX_OVERDUE'])
b['AMT_CREDIT_MAX_OVERDUE'].isnull().sum()

0

#### DAYS_ENDDATE_FACT

In [85]:
b['DAYS_ENDDATE_FACT'].value_counts(dropna=False)

DAYS_ENDDATE_FACT
 NaN       633653
-329.0        811
-273.0        794
-301.0        791
-91.0         785
            ...
-2905.0         1
-2898.0         1
-2900.0         1
-2922.0         1
-2891.0         1
Name: count, Length: 2918, dtype: int64

In [86]:
b['DAYS_ENDDATE_FACT'] = np.where(b['DAYS_ENDDATE_FACT'].isnull, b['DAYS_CREDIT_UPDATE'], b['DAYS_ENDDATE_FACT'])
b['DAYS_ENDDATE_FACT'].isnull().sum()

0

#### AMT_CREDIT_SUM_LIMIT

In [87]:
b['AMT_CREDIT_SUM_LIMIT'].value_counts(dropna=False)

AMT_CREDIT_SUM_LIMIT
0.000          1050142
NaN             591780
135000.000        2178
4500.000          1474
45000.000         1335
                ...
275075.100           1
20639.160            1
49464.000            1
1004866.920          1
135035.865           1
Name: count, Length: 51727, dtype: int64

In [88]:
b[b['AMT_CREDIT_SUM_LIMIT']==0.0][['AMT_CREDIT_SUM_LIMIT', 'AMT_CREDIT_SUM_DEBT', 'AMT_CREDIT_SUM']]

         AMT_CREDIT_SUM_LIMIT  AMT_CREDIT_SUM_DEBT  AMT_CREDIT_SUM
6                         0.0              42103.8        42103.80
7                         0.0                  0.0        76878.45
8                         0.0                  0.0       103007.70
9                         0.0                  0.0         4500.00
10                        0.0                  0.0       337500.00
...                       ...                  ...             ...
1716419                   0.0                  0.0        28248.84
1716420                   0.0                  0.0        27000.00
1716423                   0.0              11250.0        11250.00
1716424                   0.0                  0.0        38130.84
1716426                   0.0                  0.0        36000.00

[1050142 rows x 3 columns]

In [89]:
b['AMT_CREDIT_SUM_LIMIT'] = np.where((b['AMT_CREDIT_SUM_LIMIT'].isnull()) & (b['AMT_CREDIT_SUM_DEBT']==0.0) & (b['AMT_CREDIT_SUM']==0.0), 0.0, b['AMT_CREDIT_SUM_LIMIT'])
b['AMT_CREDIT_SUM_LIMIT'].isnull().sum()

584055

In [90]:
b['AMT_CREDIT_SUM_LIMIT'] = np.where((b['AMT_CREDIT_SUM_LIMIT'].isnull()) & (b['AMT_CREDIT_SUM'] == b['AMT_CREDIT_SUM_DEBT']), 0.0, b['AMT_CREDIT_SUM_LIMIT'])
b['AMT_CREDIT_SUM_LIMIT'].isnull().sum()

582076

In [106]:
b['AMT_CREDIT_SUM_LIMIT'] = b.groupby('SK_ID_CURR')['AMT_CREDIT_SUM_LIMIT'].transform(lambda x: x.fillna(x.mean()))
b['AMT_CREDIT_SUM_LIMIT'].isnull().sum()

53179

In [118]:
b['AMT_CREDIT_SUM_LIMIT'] = np.where(b['AMT_CREDIT_SUM_LIMIT'].isnull(), b['AMT_CREDIT_SUM_LIMIT'].median(), b['AMT_CREDIT_SUM_LIMIT'])
b['AMT_CREDIT_SUM_LIMIT'].isnull().sum()

0

#### AMT_CREDIT_SUM_DEBT

In [119]:
b['AMT_CREDIT_SUM_DEBT'].value_counts(dropna=False)

AMT_CREDIT_SUM_DEBT
 0.000          1016434
 NaN             257669
 4.500              653
-450.000            543
 135000.000         344
                 ...
 1396746.000          1
 650376.000           1
 477810.000           1
 312660.765           1
 1092226.500          1
Name: count, Length: 226538, dtype: int64

In [120]:
b[b['AMT_CREDIT_SUM_DEBT']==0][['AMT_CREDIT_SUM_LIMIT', 'AMT_CREDIT_SUM_DEBT', 'AMT_CREDIT_SUM']]

         AMT_CREDIT_SUM_LIMIT  AMT_CREDIT_SUM_DEBT  AMT_CREDIT_SUM
0                    36327.54                  0.0        91323.00
7                        0.00                  0.0        76878.45
8                        0.00                  0.0       103007.70
9                        0.00                  0.0         4500.00
10                       0.00                  0.0       337500.00
...                       ...                  ...             ...
1716421                  0.00                  0.0       195408.00
1716422                  0.00                  0.0       202500.00
1716424                  0.00                  0.0        38130.84
1716426                  0.00                  0.0        36000.00
1716427                  0.00                  0.0        22500.00

[1016434 rows x 3 columns]

In [121]:
b['AMT_CREDIT_SUM_DEBT'] = np.where((b['AMT_CREDIT_SUM_DEBT'].isnull()) & (b['AMT_CREDIT_SUM_LIMIT']==0.00), 0.0, b['AMT_CREDIT_SUM_DEBT'])
b['AMT_CREDIT_SUM_DEBT'].isnull().sum()

55657

In [123]:
b[b['AMT_CREDIT_SUM_DEBT']>1][['AMT_CREDIT_SUM_LIMIT', 'AMT_CREDIT_SUM_DEBT', 'AMT_CREDIT_SUM']]

         AMT_CREDIT_SUM_LIMIT  AMT_CREDIT_SUM_DEBT  AMT_CREDIT_SUM
1                   36327.540            171342.00        225000.0
5                  108982.620             71017.38        180000.0
6                       0.000             42103.80         42103.8
13                      0.000             76905.00         89910.0
17                  57080.025            520920.00        450000.0
...                       ...                  ...             ...
1716403                 0.000           1092226.50       1431000.0
1716404                 0.000            432787.50        450000.0
1716412                 0.000             10971.00        225000.0
1716417             75150.000              2466.00         67500.0
1716423                 0.000             11250.00         11250.0

[433881 rows x 3 columns]